# accounts

## Imports Libraries

In [1]:
#1
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

## Load Data

In [2]:
df = pd.read_csv('accounts.csv')

In [3]:
df.head()

   count  min_balance  max_balance country business_type  model bank_id
0    200        50000       100000      US             I      0    bank
1    200        50000       100000      US             I      1    bank
2    200        50000       100000      US             I      2    bank
3    200        50000       100000      US             I      3    bank
4    200        50000       100000      US             I      4    bank

In [4]:
df.tail()

   count  min_balance  max_balance country business_type  model bank_id
1    200        50000       100000      US             I      1    bank
2    200        50000       100000      US             I      2    bank
3    200        50000       100000      US             I      3    bank
4    200        50000       100000      US             I      4    bank
5    446        50000       100000      US             I      5    bank

In [5]:
df.shape

(6, 7)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   count          6 non-null      int64
 1   min_balance    6 non-null      int64
 2   max_balance    6 non-null      int64
 3   country        6 non-null      object
 4   business_type  6 non-null      object
 5   model          6 non-null      int64
 6   bank_id        6 non-null      object
dtypes: int64(4), object(3)
memory usage: 464.0+ bytes

## the end